Megan(
  (atom_embedding): Linear(in_features=36, out_features=1024, bias=True), 37,888 params
  (bond_embedding): Linear(in_features=11, out_features=32, bias=True), 384 params
  (encoder): MeganEncoder(
    (MultiHeadGraphConv_1): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
    (MultiHeadGraphConv_2): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
    (MultiHeadGraphConv_3): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
    (MultiHeadGraphConv_4): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
    (MultiHeadGraphConv_5): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
    (MultiHeadGraphConv_6): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
  ), 7,098,672 params
  (decoder): MeganDecoder(
    (MultiHeadGraphConv_1): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
    (MultiHeadGraphConv_2): MultiHeadGraphConvLayer(
      (atoms_att): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (final_att): Linear(in_features=288, out_features=8, bias=True), 2,312 params
      (graph_conv_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_2): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_3): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_4): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_5): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_6): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_7): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
      (graph_conv_8): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    ), 1,183,112 params
    (fc_atom_1): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    (fc_atom_2): Linear(in_features=128, out_features=47, bias=True), 6,063 params
    (fc_atom_bond): Linear(in_features=1024, out_features=128, bias=True), 131,200 params
    (fc_bond_1): Linear(in_features=160, out_features=128, bias=True), 20,608 params
    (fc_bond_2): Linear(in_features=128, out_features=7, bias=True), 903 params
  ), 2,656,198 params
), 9,793,142 params
/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/numpy/core/fromnumeric.py:61: FutureWarning: Series.nonzero() is deprecated and will be removed in a future version.Use Series.to_numpy().nonzero() instead
  return bound(*args, **kwds)
models/uspto_50k train epoch 1:   0%|          | 0/9911 [00:00<?, ?it/s]models/uspto_50k train epoch 1:   0%|          | 1/9911 [00:00<41:44,  3.96it/s]models/uspto_50k train epoch 1:   0%|          | 2/9911 [00:00<37:51,  4.36it/s]models/uspto_50k train epoch 1:   0%|          | 3/9911 [00:00<54:14,  3.04it/s]models/uspto_50k train epoch 1:   0%|          | 4/9911 [00:01<51:26,  3.21it/s]models/uspto_50k train epoch 1:   0%|          | 5/9911 [00:01<48:27,  3.41it/s]models/uspto_50k train epoch 1:   0%|          | 6/9911 [00:01<43:30,  3.79it/s]models/uspto_50k train epoch 1:   0%|          | 7/9911 [00:01<40:14,  4.10it/s]models/uspto_50k train epoch 1:   0%|          | 8/9911 [00:02<38:46,  4.26it/s]models/uspto_50k train epoch 1:   0%|          | 9/9911 [00:02<43:06,  3.83it/s]models/uspto_50k train epoch 1:   0%|          | 10/9911 [00:02<41:14,  4.00it/s]models/uspto_50k train epoch 1:   0%|          | 11/9911 [00:02<42:43,  3.86it/s]models/uspto_50k train epoch 1:   0%|          | 12/9911 [00:03<39:33,  4.17it/s]models/uspto_50k train epoch 1:   0%|          | 12/9911 [00:03<45:00,  3.67it/s]
Traceback (most recent call last):
  File "bin/train.py", line 356, in <module>
    dispatch_utils.dispatch_configurable_command(train_megan)
  File "/home/linmin001/megan_77777777/src/utils/dispatch_utils.py", line 187, in dispatch_configurable_command
    os.path.join(save_path, "stderr.txt"))(save_path)
  File "/home/linmin001/megan_77777777/src/utils/dispatch_utils.py", line 119, in func_wrapper
    func(*args, **kwargs)
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/gin/config.py", line 1078, in gin_wrapper
    utils.augment_exception_message_and_reraise(e, err_str)
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/gin/utils.py", line 49, in augment_exception_message_and_reraise
    six.raise_from(proxy.with_traceback(exception.__traceback__), None)
  File "<string>", line 3, in raise_from
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/gin/config.py", line 1055, in gin_wrapper
    return fn(*new_args, **new_kwargs)
  File "bin/train.py", line 316, in train_megan
    lr_step=warmup_lr_step if epoch_i < megan_warmup_epochs else 0.0)
  File "bin/train.py", line 223, in run_epoch
    raise e
  File "bin/train.py", line 212, in run_epoch
    batch_metrics = run_batch(all_ind, train)
  File "bin/train.py", line 117, in run_batch
    batch_result = model(batch)
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/torch/nn/modules/module.py", line 541, in __call__
    result = self.forward(*input, **kwargs)
  File "/home/linmin001/megan_77777777/src/model/megan.py", line 125, in forward
    step_results = self.forward_step(step_batch, state_dict=state_dict)
  File "/home/linmin001/megan_77777777/src/model/megan.py", line 177, in forward_step
    state, output, mask = self.decoder(step_batch)
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/torch/nn/modules/module.py", line 541, in __call__
    result = self.forward(*input, **kwargs)
  File "/home/linmin001/megan_77777777/src/model/megan_modules/decoder.py", line 121, in forward
    node_state, atom_actions_feat, bond_actions_feat = self.forward_embedding(x)
  File "/home/linmin001/megan_77777777/src/model/megan_modules/decoder.py", line 116, in forward_embedding
    bond_actions_feat = self._forward_bond_features(atom_feats, x['adj'])
  File "/home/linmin001/megan_77777777/src/model/megan_modules/decoder.py", line 93, in _forward_bond_features
    bond_actions_feat = torch.relu(bond_layer(bond_actions_feat))
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/torch/nn/modules/module.py", line 541, in __call__
    result = self.forward(*input, **kwargs)
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/torch/nn/modules/linear.py", line 87, in forward
    return F.linear(input, self.weight, self.bias)
  File "/home/linmin001/.conda/envs/megan/lib/python3.6/site-packages/torch/nn/functional.py", line 1372, in linear
    output = input.matmul(weight.t())
RuntimeError: CUDA out of memory. Tried to allocate 20.00 MiB (GPU 0; 10.76 GiB total capacity; 1.77 GiB already allocated; 7.75 MiB free; 14.19 MiB cached)
  In call to configurable 'train_megan' (<function train_megan at 0x2aab383318c8>)
